{"basics":{"name":"Nugraha Setya Ardi","image":"","email":"nsadatascience@gmail.com","url":"https://nugrahasetyaardi83.github.io","summary":"A Data Scientist with Aerospace Engineering background"},"work":[{"name":"XAPIENS TEKNOLOGI INDONESIA, part of Indika Energy Group","position":"Data Scientist","startDate":"2022-10-01","endDate":"present","summary":"As a data scientist in an IT consultant company, my works vary a lot depending on the clients' need. Some projects that I have worked on are the following","highlights":["Predictive Maintenance: Achieved 5% reduction in maintenance costs compared to Condition Based Maintenance (CBM) through successful implementation of predictive maintenance (PdM) using various methods such as Survival Analysis, Bayesian Regression, machine learning, deep learning, and similarity methods, for estimating Remaining Useful Life (RUL) of machinery.","Conformal Prediction: utilized Conformal Prediction to ensure precise prediction intervals across multiple projects, enhancing accuracy and reliability of predictions.","Time Series: Performed time series forecasting initiatives for coal demand estimation of a mining company client, leveraging a range of techniques such as ARIMA, Theta Forecaster, ETS, GARCH, machine learning and deep learning models like Prophet and N-Beats.","Topic Modelling: applied Natural Language Processing (NLP) methodologies including Latent Dirichlet Allocation (LDA), Non-negative Matrix Factorization (NMF), Latent Semantic Indexing (LSI), and TF-IDF for topic modeling tasks, enhancing understanding and organization of textual data.","Word Co-Occurence Map: Developed word co-occurrence maps using various methods including word-word frequency matrix, word-document frequency matrix, PPMI, word2vec, TF-IDF, custom embedding training, and Fasttext, facilitating comprehensive analysis and visualization of textual relationships.","Interpretable Machine Learning: implemented interpretable machine learning techniques such as SHAP and Lime to enhance model understanding thus providing actionable insights to stakeholders across diverse projects.","Bayesian Optimization: applied Sequential Bayesian Optimization for a paddy rice peeler, optimizing resource utilization and reducing evaluation costs in each iteration, thus enabling efficient proof of concept (PoC) execution.","Video Stitching: developed a video stitching algorithm for proof of concept (PoC) purposes, demonstrating capabilities in computer vision and image processing.","Exploratory Data Analysis: conducted Exploratory Data Analysis for a mining company client, resulting in a 7% increase in annual revenue by uncovering valuable insights from data exploration efforts."]},{"name":"PHYSICS OLYMPIAD TUTOR","position":"self-employed physics tutor","startDate":"2016","endDate":"2020","summary":"Taught physics olympiad for junior and senior high school students"},{"name":"SPACE LABORATORY INSTITUT TEKNOLOGI BANDUNG","position":"Researcher","startDate":"2018-01-01","endDate":"2018-12-01","summary":"Part of the Aerospace Department Laboratory focused on satellite technology research ","highlights":["Performed research mainly on star sensor/star tracker for satellites.","Wrote 4 papers and became the speaker at various international conferences in satellite technology."]},{"name":"LAPAN PUSTEKBANG","position":"Researcher","startDate":"2017-03-01","endDate":"2017-04-01","summary":"Now part of BRIN","highlights":["Performed analysis on 2D wing with flap using Ansys Fluent."]}],"education":[{"institution":"Politecnico di Milano","location":"Milano, Italy","area":"Space Engineering","studyType":"MSc","startDate":"2020-03-01","endDate":"2023-07-27","score":"94/110","courses":["Operation Research: Linear Programming, Integer Linear Programming, Non-Linear Integer Programming, Multi-Objective Optimization, Graph & Network Optimization, Heuristic & Metaheuristic algorithm.","Estimation and Learning in Aerospace: Estimation Theory, Dimensionality Reduction & PCA, SVM, Kalman Filter, Extended Kalman Filter, Black-Box Model Identification.","Machine Learning: Python (NumPy, Pandas, Scikit-Learn), Statistics, Generalized Linear Regression, Logistic Regression, Linear Discriminant Analysis, SVM, Decision Tree, Random Forest, K-Means, DBSCAN, PCA, Data Visualization (Matplotlib, Seaborn, Tableau)","Deep Learning: TensorFlow, PyTorch, CNN, Transfer Learning, Generative AI (GAN), Natural Language Processing (NLP), Transformer, RNN, LSTM."]},{"institution":"Institut Teknologi Bandung","location":"Bandung, Indonesia","area":"Aerospace Engineering","studyType":"BSc","startDate":"2014-06-01","endDate":"2018-07-01","score":"3.66/4","courses":[""]}],"awards":[{"title":"Bronze Medal in Indonesian National Physics Olympiad 2013","date":"2013","awarder":"Kemendikbud"}],"publications":[{"name":"A Supervised Learning-based approach to Maneuver Detection through TLE Data Mining","publisher":"Springer","releaseDate":"2023-06-17","url":"https://link.springer.com/chapter/10.1007/978-3-031-25755-1_28","summary":"A Deep Learning approach to detect and characterize satellite manuever through TLE (Two Line Elements) time series."}],"skills":[{"name":"Programming","level":"Master","icon":"fa-solid fa-tag","keywords":["Python","SQL","Matlab","Simulink","LaTeX"]},{"name":"AI/Data Science/Machine Learning/Deep Learning","level":"Master","icon":"fa-solid fa-tag","keywords":["Machine Learning Models (linear regression, SVM, logistic regression, KNN, K-means, Naive Bayes, etc.)","Deep Learning Models (DNN, RNN, LSTM, CNN, etc.)","Time Series Analysis & Forecasting","Predictive Maintenance","Survival Analysis","Conformal Prediction","Exploratory Data Analysis","Image Processing","Computer Vision","Natural Language Processing","Interpretable Machine Learning/Explainable AI","Bayesian Statistics & Inference"]}],"languages":[{"language":"Bahasa Indonesia","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}]}